app/controllers/cardapios_controller.rb

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 3]]
---
  def show

    @order_items = current_order.order_items